dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP_GPIO.c

/* ########################################################################## */
/*
 * This file was created by www.DavesMotleyProjects.com
 *
 * This software is provided under the following conditions:
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * 'Software'), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
 * CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
 * TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *                                                                            */
/* ########################################################################## */


/* ===========================================================================*/
/*
 * FileName:      MSP430F5529LP_GPIO.c
 *
 * This file provides functions to control and configure the General Purpose
 * Input / Output (GPIO) pins on the Texas Instruments MSP430F5529 Launchpad
 * development board. These functions provide "arduino-style" control of the
 * pins based on pin number (as viewed from the external package).
 *
 * Version 1.0
 *
 * Rev. 1.0, Initial Release
 *
 *                                                                            */
/* ===========================================================================*/

#include "MSP430F5529LP.h"
#include "MSP430F5529LP_GPIO.h"


/******************************************************************************
    PUBLIC DEFINITIONS
******************************************************************************/

   
/******************************************************************************
    PUBLIC VARIABLES
******************************************************************************/
  
 
/******************************************************************************
    PRIVATE DEFINITIONS (static const)
******************************************************************************/


/******************************************************************************
    PRIVATE FUNCTION PROTOTYPES (static)
******************************************************************************/


/******************************************************************************
    PRIVATE VARIABLES (static)
******************************************************************************/


/******************************************************************************
    Subroutine:     pinDirection
    Description:    Function to set pin direction (input or output)
    Inputs:         pin (uint8_t) is a value between 1 and 80, corresponding to
                    a valid GPIO pin Passing in illegal values has no effect.
                    pinDir (pinDirection_enum) can have the values INPUT or
                    OUTPUT, which defines the desired direction.
    Outputs:        None

******************************************************************************/
void pinDirection(uint8_t pin, pinDirection_enum pinDir)
{
    switch(pin)
    {
        case (1):  P6DIR_bits.P6DIR4 = pinDir; break;    //P6.4, CB4, A4
        case (2):  P6DIR_bits.P6DIR5 = pinDir; break;    //P6.5, CB5, A5
        case (3):  P6DIR_bits.P6DIR6 = pinDir; break;    //P6.6, CB6, A6
        case (4):  P6DIR_bits.P6DIR7 = pinDir; break;    //P6.7, CB7, A7
        case (5):  P7DIR_bits.P7DIR0 = pinDir; break;    //P7.0, CB8, A12
        case (6):  P7DIR_bits.P7DIR1 = pinDir; break;    //P7.1, CB9, A13
        case (7):  P7DIR_bits.P7DIR2 = pinDir; break;    //P7.2, CB10, A14
        case (8):  P7DIR_bits.P7DIR3 = pinDir; break;    //P7.3, CB11, A15
        case (9):  P5DIR_bits.P5DIR0 = pinDir; break;    //P5.0, A8, VREF+, VeREF+
        case (10): P5DIR_bits.P5DIR1 = pinDir; break;    //P5.1, A9, VREF-, VeREF-
        case (12): P5DIR_bits.P5DIR4 = pinDir; break;    //P5.4, XIN
        case (13): P5DIR_bits.P5DIR5 = pinDir; break;    //P5.5, XOUT
        case (15): P8DIR_bits.P8DIR0 = pinDir; break;    //P8.0
        case (16): P8DIR_bits.P8DIR1 = pinDir; break;    //P8.1
        case (17): P8DIR_bits.P8DIR2 = pinDir; break;    //P8.2
        case (21): P1DIR_bits.P1DIR0 = pinDir; break;    //P1.0, TA0CLK, ACLK
        case (22): P1DIR_bits.P1DIR1 = pinDir; break;    //P1.1, TA0.0
        case (23): P1DIR_bits.P1DIR2 = pinDir; break;    //P1.2, TA0.1
        case (24): P1DIR_bits.P1DIR3 = pinDir; break;    //P1.3, TA0.2
        case (25): P1DIR_bits.P1DIR4 = pinDir; break;    //P1.4, TA0.3
        case (26): P1DIR_bits.P1DIR5 = pinDir; break;    //P1.5, TA0.4
        case (27): P1DIR_bits.P1DIR6 = pinDir; break;    //P1.6, TA1CLK, CBOUT
        case (28): P1DIR_bits.P1DIR7 = pinDir; break;    //P1.7, TA1.0
        case (29): P2DIR_bits.P2DIR0 = pinDir; break;    //P2.0, TA1.1
        case (30): P2DIR_bits.P2DIR1 = pinDir; break;    //P2.1, TA1.2
        case (31): P2DIR_bits.P2DIR2 = pinDir; break;    //P2.2, TA2CLK, SMCLK
        case (32): P2DIR_bits.P2DIR3 = pinDir; break;    //P2.3, TA2.0
        case (33): P2DIR_bits.P2DIR4 = pinDir; break;    //P2.4, TA2.1
        case (34): P2DIR_bits.P2DIR5 = pinDir; break;    //P2.5, TA2.2
        case (35): P2DIR_bits.P2DIR6 = pinDir; break;    //P2.6, RTCCLK, DMAE0
        case (36): P2DIR_bits.P2DIR7 = pinDir; break;    //P2.7, UCB0STE, UCA0CLK
        case (37): P3DIR_bits.P3DIR0 = pinDir; break;    //P3.0, UCB0SIMO, UCB0SDA
        case (38): P3DIR_bits.P3DIR1 = pinDir; break;    //P3.1, UCB0SOMI, UCB0SCL
        case (39): P3DIR_bits.P3DIR2 = pinDir; break;    //P3.2, UCB0CLK, UCA0STE
        case (40): P3DIR_bits.P3DIR3 = pinDir; break;    //P3.3, UCA0TXD, UCA0SIMO
        case (41): P3DIR_bits.P3DIR4 = pinDir; break;    //P3.4, UCA0RXD, UCA0SOMI
        case (42): P3DIR_bits.P3DIR5 = pinDir; break;    //P3.5, TB0.5
        case (43): P3DIR_bits.P3DIR6 = pinDir; break;    //P3.6, TB0.6
        case (44): P3DIR_bits.P3DIR7 = pinDir; break;    //P3.7, TB0OUTH, SVMOUT
        case (45): P4DIR_bits.P4DIR0 = pinDir; break;    //P4.0, PM_UCB1STE, PM_UCA1CLK
        case (46): P4DIR_bits.P4DIR1 = pinDir; break;    //P4.1, PM_UCB1SIMO, PM_UCB1SDA
        case (47): P4DIR_bits.P4DIR2 = pinDir; break;    //P4.2, PM_UCB1SOMI, PM_UCB1SCL
        case (48): P4DIR_bits.P4DIR3 = pinDir; break;    //P4.3, PM_UCB1CLK, PM_UCA1STE
        case (51): P4DIR_bits.P4DIR4 = pinDir; break;    //P4.4, PM_UCA1TXD, PM_UCA1SIMO
        case (52): P4DIR_bits.P4DIR5 = pinDir; break;    //P4.5, PM_UCA1RXD, PM_UCA1SOMI
        case (53): P4DIR_bits.P4DIR6 = pinDir; break;    //P4.6, PM_NONE
        case (54): P4DIR_bits.P4DIR7 = pinDir; break;    //P4.7, PM_NONE
        case (55): P5DIR_bits.P5DIR6 = pinDir; break;    //P5.6, TB0.0
        case (56): P5DIR_bits.P5DIR7 = pinDir; break;    //P5.7, TB0.1
        case (57): P7DIR_bits.P7DIR4 = pinDir; break;    //P7.4, TB0.2
        case (58): P7DIR_bits.P7DIR5 = pinDir; break;    //P7.5, TB0.3
        case (59): P7DIR_bits.P7DIR6 = pinDir; break;    //P7.6, TB0.4
        case (60): P7DIR_bits.P7DIR7 = pinDir; break;    //P7.7, TB0CLK, MCLK
        case (69): P5DIR_bits.P5DIR2 = pinDir; break;    //P5.2, XT2IN
        case (70): P5DIR_bits.P5DIR3 = pinDir; break;    //P5.3, XT2OUT
        case (77): P6DIR_bits.P6DIR0 = pinDir; break;    //P6.0, CB0, A0
        case (78): P6DIR_bits.P6DIR1 = pinDir; break;    //P6.1, CB1, A1
        case (79): P6DIR_bits.P6DIR2 = pinDir; break;    //P6.2, CB2, A2
        case (80): P6DIR_bits.P6DIR3 = pinDir; break;    //P6.3, CB3, A3
        default: break;
    }
}
   
   
