dhunt1342/MSP430F5529LP/Libraries/Hardware/MSP430F5529LP_GPIO.c
 /******************************************************************************
    Subroutine:     pinResEnable
    Description:    Function to enable/disable the internal resistor on the
                    specified pin. The type of resistor (pullup/pulldown) is
                    specified seperately.
    Inputs:         pin (uint8_t) is a value between 1 and 80, corresponding to
                    a valid GPIO pin Passing in illegal values has no effect.
                    rEnable (pinEnable_enum) can have the values DISABLE or
                    ENABLE, which defines the connection state of the internal
                    resistor.
    Outputs:        None

******************************************************************************/  
void pinResEnable(uint8_t pin, pinEnable_enum rEnable)
{
    switch(pin)
    {
        case (1):  P6REN_bits.P6REN4 = rEnable; break;   //P6.4, CB4, A4
        case (2):  P6REN_bits.P6REN5 = rEnable; break;   //P6.5, CB5, A5
        case (3):  P6REN_bits.P6REN6 = rEnable; break;   //P6.6, CB6, A6
        case (4):  P6REN_bits.P6REN7 = rEnable; break;   //P6.7, CB7, A7
        case (5):  P7REN_bits.P7REN0 = rEnable; break;   //P7.0, CB8, A12
        case (6):  P7REN_bits.P7REN1 = rEnable; break;   //P7.1, CB9, A13
        case (7):  P7REN_bits.P7REN2 = rEnable; break;   //P7.2, CB10, A14
        case (8):  P7REN_bits.P7REN3 = rEnable; break;   //P7.3, CB11, A15
        case (9):  P5REN_bits.P5REN0 = rEnable; break;   //P5.0, A8, VREF+, VeREF+
        case (10): P5REN_bits.P5REN1 = rEnable; break;   //P5.1, A9, VREF-, VeREF-
        case (12): P5REN_bits.P5REN4 = rEnable; break;   //P5.4, XIN
        case (13): P5REN_bits.P5REN5 = rEnable; break;   //P5.5, XOUT
        case (15): P8REN_bits.P8REN0 = rEnable; break;   //P8.0
        case (16): P8REN_bits.P8REN1 = rEnable; break;   //P8.1
        case (17): P8REN_bits.P8REN2 = rEnable; break;   //P8.2
        case (21): P1REN_bits.P1REN0 = rEnable; break;   //P1.0, TA0CLK, ACLK
        case (22): P1REN_bits.P1REN1 = rEnable; break;   //P1.1, TA0.0
        case (23): P1REN_bits.P1REN2 = rEnable; break;   //P1.2, TA0.1
        case (24): P1REN_bits.P1REN3 = rEnable; break;   //P1.3, TA0.2
        case (25): P1REN_bits.P1REN4 = rEnable; break;   //P1.4, TA0.3
        case (26): P1REN_bits.P1REN5 = rEnable; break;   //P1.5, TA0.4
        case (27): P1REN_bits.P1REN6 = rEnable; break;   //P1.6, TA1CLK, CBOUT
        case (28): P1REN_bits.P1REN7 = rEnable; break;   //P1.7, TA1.0
        case (29): P2REN_bits.P2REN0 = rEnable; break;   //P2.0, TA1.1
        case (30): P2REN_bits.P2REN1 = rEnable; break;   //P2.1, TA1.2
        case (31): P2REN_bits.P2REN2 = rEnable; break;   //P2.2, TA2CLK, SMCLK
        case (32): P2REN_bits.P2REN3 = rEnable; break;   //P2.3, TA2.0
        case (33): P2REN_bits.P2REN4 = rEnable; break;   //P2.4, TA2.1
        case (34): P2REN_bits.P2REN5 = rEnable; break;   //P2.5, TA2.2
        case (35): P2REN_bits.P2REN6 = rEnable; break;   //P2.6, RTCCLK, DMAE0
        case (36): P2REN_bits.P2REN7 = rEnable; break;   //P2.7, UCB0STE, UCA0CLK
        case (37): P3REN_bits.P3REN0 = rEnable; break;   //P3.0, UCB0SIMO, UCB0SDA
        case (38): P3REN_bits.P3REN1 = rEnable; break;   //P3.1, UCB0SOMI, UCB0SCL
        case (39): P3REN_bits.P3REN2 = rEnable; break;   //P3.2, UCB0CLK, UCA0STE
        case (40): P3REN_bits.P3REN3 = rEnable; break;   //P3.3, UCA0TXD, UCA0SIMO
        case (41): P3REN_bits.P3REN4 = rEnable; break;   //P3.4, UCA0RXD, UCA0SOMI
        case (42): P3REN_bits.P3REN5 = rEnable; break;   //P3.5, TB0.5
        case (43): P3REN_bits.P3REN6 = rEnable; break;   //P3.6, TB0.6
        case (44): P3REN_bits.P3REN7 = rEnable; break;   //P3.7, TB0OUTH, SVMOUT
        case (45): P4REN_bits.P4REN0 = rEnable; break;   //P4.0, PM_UCB1STE, PM_UCA1CLK
        case (46): P4REN_bits.P4REN1 = rEnable; break;   //P4.1, PM_UCB1SIMO, PM_UCB1SDA
        case (47): P4REN_bits.P4REN2 = rEnable; break;   //P4.2, PM_UCB1SOMI, PM_UCB1SCL
        case (48): P4REN_bits.P4REN3 = rEnable; break;   //P4.3, PM_UCB1CLK, PM_UCA1STE
        case (51): P4REN_bits.P4REN4 = rEnable; break;   //P4.4, PM_UCA1TXD, PM_UCA1SIMO
        case (52): P4REN_bits.P4REN5 = rEnable; break;   //P4.5, PM_UCA1RXD, PM_UCA1SOMI
        case (53): P4REN_bits.P4REN6 = rEnable; break;   //P4.6, PM_NONE
        case (54): P4REN_bits.P4REN7 = rEnable; break;   //P4.7, PM_NONE
        case (55): P5REN_bits.P5REN6 = rEnable; break;   //P5.6, TB0.0
        case (56): P5REN_bits.P5REN7 = rEnable; break;   //P5.7, TB0.1
        case (57): P7REN_bits.P7REN4 = rEnable; break;   //P7.4, TB0.2
        case (58): P7REN_bits.P7REN5 = rEnable; break;   //P7.5, TB0.3
        case (59): P7REN_bits.P7REN6 = rEnable; break;   //P7.6, TB0.4
        case (60): P7REN_bits.P7REN7 = rEnable; break;   //P7.7, TB0CLK, MCLK
        case (69): P5REN_bits.P5REN2 = rEnable; break;   //P5.2, XT2IN
        case (70): P5REN_bits.P5REN3 = rEnable; break;   //P5.3, XT2OUT
        case (77): P6REN_bits.P6REN0 = rEnable; break;   //P6.0, CB0, A0
        case (78): P6REN_bits.P6REN1 = rEnable; break;   //P6.1, CB1, A1
        case (79): P6REN_bits.P6REN2 = rEnable; break;   //P6.2, CB2, A2
        case (80): P6REN_bits.P6REN3 = rEnable; break;   //P6.3, CB3, A3
        default: break;
    }
}
   

 /******************************************************************************
    Subroutine:     pinOutput
    Description:    Function to set the output state of the specified pin.
    Inputs:         pin (uint8_t) is a value between 1 and 80, corresponding to
                    a valid GPIO pin Passing in illegal values has no effect.
                    pLevel (pinLevel_enum) can have the values LOW or HIGH,
                    which defines the output level.
    Outputs:        None

******************************************************************************/ 
void pinOutput(uint8_t pin, pinLevel_enum pLevel)
{
    switch(pin)
    {
        case (1):  P6OUT_bits.P6OUT4 = pLevel; break;    //P6.4, CB4, A4
        case (2):  P6OUT_bits.P6OUT5 = pLevel; break;    //P6.5, CB5, A5
        case (3):  P6OUT_bits.P6OUT6 = pLevel; break;    //P6.6, CB6, A6
        case (4):  P6OUT_bits.P6OUT7 = pLevel; break;    //P6.7, CB7, A7
        case (5):  P7OUT_bits.P7OUT0 = pLevel; break;    //P7.0, CB8, A12
        case (6):  P7OUT_bits.P7OUT1 = pLevel; break;    //P7.1, CB9, A13
        case (7):  P7OUT_bits.P7OUT2 = pLevel; break;    //P7.2, CB10, A14
        case (8):  P7OUT_bits.P7OUT3 = pLevel; break;    //P7.3, CB11, A15
        case (9):  P5OUT_bits.P5OUT0 = pLevel; break;    //P5.0, A8, VREF+, VeREF+
        case (10): P5OUT_bits.P5OUT1 = pLevel; break;    //P5.1, A9, VREF-, VeREF-
        case (12): P5OUT_bits.P5OUT4 = pLevel; break;    //P5.4, XIN
        case (13): P5OUT_bits.P5OUT5 = pLevel; break;    //P5.5, XOUT
        case (15): P8OUT_bits.P8OUT0 = pLevel; break;    //P8.0
        case (16): P8OUT_bits.P8OUT1 = pLevel; break;    //P8.1
        case (17): P8OUT_bits.P8OUT2 = pLevel; break;    //P8.2
        case (21): P1OUT_bits.P1OUT0 = pLevel; break;    //P1.0, TA0CLK, ACLK
        case (22): P1OUT_bits.P1OUT1 = pLevel; break;    //P1.1, TA0.0
        case (23): P1OUT_bits.P1OUT2 = pLevel; break;    //P1.2, TA0.1
        case (24): P1OUT_bits.P1OUT3 = pLevel; break;    //P1.3, TA0.2
        case (25): P1OUT_bits.P1OUT4 = pLevel; break;    //P1.4, TA0.3
        case (26): P1OUT_bits.P1OUT5 = pLevel; break;    //P1.5, TA0.4
        case (27): P1OUT_bits.P1OUT6 = pLevel; break;    //P1.6, TA1CLK, CBOUT
        case (28): P1OUT_bits.P1OUT7 = pLevel; break;    //P1.7, TA1.0
        case (29): P2OUT_bits.P2OUT0 = pLevel; break;    //P2.0, TA1.1
        case (30): P2OUT_bits.P2OUT1 = pLevel; break;    //P2.1, TA1.2
        case (31): P2OUT_bits.P2OUT2 = pLevel; break;    //P2.2, TA2CLK, SMCLK
        case (32): P2OUT_bits.P2OUT3 = pLevel; break;    //P2.3, TA2.0
        case (33): P2OUT_bits.P2OUT4 = pLevel; break;    //P2.4, TA2.1
        case (34): P2OUT_bits.P2OUT5 = pLevel; break;    //P2.5, TA2.2
        case (35): P2OUT_bits.P2OUT6 = pLevel; break;    //P2.6, RTCCLK, DMAE0
        case (36): P2OUT_bits.P2OUT7 = pLevel; break;    //P2.7, UCB0STE, UCA0CLK
        case (37): P3OUT_bits.P3OUT0 = pLevel; break;    //P3.0, UCB0SIMO, UCB0SDA
        case (38): P3OUT_bits.P3OUT1 = pLevel; break;    //P3.1, UCB0SOMI, UCB0SCL
        case (39): P3OUT_bits.P3OUT2 = pLevel; break;    //P3.2, UCB0CLK, UCA0STE
        case (40): P3OUT_bits.P3OUT3 = pLevel; break;    //P3.3, UCA0TXD, UCA0SIMO
        case (41): P3OUT_bits.P3OUT4 = pLevel; break;    //P3.4, UCA0RXD, UCA0SOMI
        case (42): P3OUT_bits.P3OUT5 = pLevel; break;    //P3.5, TB0.5
        case (43): P3OUT_bits.P3OUT6 = pLevel; break;    //P3.6, TB0.6
        case (44): P3OUT_bits.P3OUT7 = pLevel; break;    //P3.7, TB0OUTH, SVMOUT
        case (45): P4OUT_bits.P4OUT0 = pLevel; break;    //P4.0, PM_UCB1STE, PM_UCA1CLK
        case (46): P4OUT_bits.P4OUT1 = pLevel; break;    //P4.1, PM_UCB1SIMO, PM_UCB1SDA
        case (47): P4OUT_bits.P4OUT2 = pLevel; break;    //P4.2, PM_UCB1SOMI, PM_UCB1SCL
        case (48): P4OUT_bits.P4OUT3 = pLevel; break;    //P4.3, PM_UCB1CLK, PM_UCA1STE
        case (51): P4OUT_bits.P4OUT4 = pLevel; break;    //P4.4, PM_UCA1TXD, PM_UCA1SIMO
        case (52): P4OUT_bits.P4OUT5 = pLevel; break;    //P4.5, PM_UCA1RXD, PM_UCA1SOMI
        case (53): P4OUT_bits.P4OUT6 = pLevel; break;    //P4.6, PM_NONE
        case (54): P4OUT_bits.P4OUT7 = pLevel; break;    //P4.7, PM_NONE
        case (55): P5OUT_bits.P5OUT6 = pLevel; break;    //P5.6, TB0.0
        case (56): P5OUT_bits.P5OUT7 = pLevel; break;    //P5.7, TB0.1
        case (57): P7OUT_bits.P7OUT4 = pLevel; break;    //P7.4, TB0.2
        case (58): P7OUT_bits.P7OUT5 = pLevel; break;    //P7.5, TB0.3
        case (59): P7OUT_bits.P7OUT6 = pLevel; break;    //P7.6, TB0.4
        case (60): P7OUT_bits.P7OUT7 = pLevel; break;    //P7.7, TB0CLK, MCLK
        case (69): P5OUT_bits.P5OUT2 = pLevel; break;    //P5.2, XT2IN
        case (70): P5OUT_bits.P5OUT3 = pLevel; break;    //P5.3, XT2OUT
        case (77): P6OUT_bits.P6OUT0 = pLevel; break;    //P6.0, CB0, A0
        case (78): P6OUT_bits.P6OUT1 = pLevel; break;    //P6.1, CB1, A1
        case (79): P6OUT_bits.P6OUT2 = pLevel; break;    //P6.2, CB2, A2
        case (80): P6OUT_bits.P6OUT3 = pLevel; break;    //P6.3, CB3, A3
        default: break;
    }
}

